package com.example.quiz.data

import com.example.quiz.model.Question

var Questions: List<Question> = listOf(
    Question(
        id = 1,
        question = "Призраком какого факультета был Кровавый барон?",
        answers = listOf("Когтевран", "Пуффендуй", "Гриффиндор", "Слизерин"),
        trueAnswer = 3
    ),
    Question(
        id = 2,
        question = "Как звали трехголовую собаку, охранявшую Философский камень?",
        answers = listOf("Клык", "Мохунтик", "Пушок", "Нюхлер"),
        trueAnswer = 2
    ),
    Question(
        id = 3,
        question = "На какой улице жили Дурсли?",
        answers = listOf("Тисовая улица, дом 4", "Вулвинский проезд, дом 7",
            "Площадь Гриммо, дом 12", "Омутная улица, дом 93"),
        trueAnswer = 0
    ),
    Question(
        id = 4,
        question = "Как называется заклинание, которое изобрел Снейп?",
        answers = listOf("Диффиндо", "Сектумсемпра", "Авада Кедавра", "Редукто"),
        trueAnswer = 1
    ),
    Question(
        id = 5,
        question = "Какое заклинание используют волшебники для создания Патронуса?",
        answers = listOf("Империо", "Редукто", "Авада Кедавра", "Экспекто Патронум"),
        trueAnswer = 3
    ),
    Question(
        id = 6,
        question = "Как называется волшебная палочка, которая никогда не проигрывает в поединке?",
        answers = listOf("Бузинная палочка", "Палочка из пера феникса",
            "Палочка из сердца дракона", "Палочка Смерти"),
        trueAnswer = 0
    ),
    Question(
        id = 7,
        question = "Как назывался предмет, который Дамблдор передал Гермионе в завещании?",
        answers = listOf("Кубок Хельги Хаффлпафф", "Снич",
            "Сказки Барда Бидля", "Волшебный фонарик"),
        trueAnswer = 2
    ),
    Question(
        id = 8,
        question = "Как звали эльфа-домовика, который служил семейству Блэков, " +
                "а затем перешел к Гарри?",
        answers = listOf("Добби", "Кричер", "Хокси", "Винки"),
        trueAnswer = 1
    ),
    Question(
        id = 9,
        question = "Какое звание в квиддиче занимала Анжелина Джонсон в команде Гриффиндора?",
        answers = listOf("Загонщик", "Вратарь", "Охотник", "Ловец"),
        trueAnswer = 2
    ),
    Question(
        id = 10,
        question = "Кто был директором Хогвартса до Альбуса Дамблдора?",
        answers = listOf("Финеас Найджелус Блэк", "Гораций Слизнорт",
            "Кандида Когтевран", "Армандо Диппет"),
        trueAnswer = 3
    )
)
